//オブジェクト指向の概要

/*
・オブジェクト指向
オブジェクト指向を技術書やWebサイトで調べても色々な解釈や説明があり戸惑ってしまうかもしれません。
オブジェクト指向とは、プログラムを現実世界の「もの（オブジェクト）」に見立てた単位で部品化し、拡張性や保守性の高いシステムの構築を目指す考え方です。
オブジェクト指向では、「カプセル化」「継承」「ポリモーフィズム(多態性)」を３大要素と呼んでいます。
３大要素については、それぞれ１２章～１４章で詳しく説明します。




・クラス、インスタンス、オブジェクト
オブジェクトとは、実体がある「もの」だけでなく実体がない概念など、全てを現実世界の「もの」に見立てて、まとめたものです。クラスもインスタンスもオブジェクトのため、クラスやインスタンスの総称とも言われます。

もう少し分かりやすく説明します。
オブジェクト指向では、コンピュータや車、犬や私や貴方だけでなく、夢や天気も「オブジェクト（もの）」として扱います。

貴方と車は、同じ「オブジェクト」でも共通点がない違う種類の「オブジェクト」ですが、貴方と私では、人間という共通の状態と振る舞いを持った同じ種類の「オブジェクト」に見立てることができます。その同じ種類の「オブジェクト」を定義したのものが「クラス」になります。

例えば、人間を名前や年齢を持っていて、挨拶ができる「オブジェクト」として、人間クラスを定義したとします。
「私」は、人間クラスを実体化した「インスタンス」になります。「インスタンス」は、「クラス」から生成された「オブジェクト」なので、「私」は、人間クラスの「オブジェクト」でもあります。「貴方」も同じように人間クラスの「インスタンス」で「オブジェクト」でもあります。







*/